GHB2/src/Documents/гхб_СвязьРаботниковСПропусками/гхб_СвязьРаботниковСПропусками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_СвязьРаботниковСПропусками</name>
  <registerRecords>InformationRegister.гхб_ИсторияВыдачиПостоянныхПропусков</registerRecords>
  <attributes>
    <name>ИдентификаторДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_ИсторияВыдачиПостоянныхПропусков/гхб_ИсторияВыдачиПостоянныхПропусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ИсторияВыдачиПостоянныхПропусков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>НомерПропуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Documents/гхб_СвязьРаботниковСПропусками/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Стр Из Данные Цикл
		
		Если Стр.Использовать Тогда
		
			_Строка = Движения.гхб_ИсторияВыдачиПостоянныхПропусков.Добавить();
			_Строка.Период = Дата;
			_Строка.Регистратор = Ссылка;
			_Строка.Сотрудник = Стр.Сотрудник;
			_Строка.НомерПропуска = Стр.НомерПропуска;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Движения.гхб_ИсторияВыдачиПостоянныхПропусков.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
